// General
"Alert.Ok" = "OK";
"Alert.Cancel" = "Cancel";

// Units
"Unit.Minutes" = "min";
"Unit.Hours" = "h";
"Unit.Meters" = "m";
"Unit.Kilometers" = "km";

// Location Services
"LocationServices.DisabledTitle" = "Location Service Disabled";
"LocationServices.DisabledMsg" = "Please open this app\'s settings and set location access to \'Always\'.";

// Selector View
"SelectorView.NoFocus" = "…";

// SplashView
"SplashView.UpdatingBundle" = "Updating bundle…";
"SplashView.LoadingParameters" = "Loading parameters…";
"SplashView.LoadingMap" = "Loading map…";
"SplashView.LoadingPlaceData" = "Loading map content…";
"SplashView.SelectingDataset" = "Entering map…";

// Bundle Manager
"BundleUpdater.DownloadMap" = "Download map?";
"BundleUpdater.UpdateConfirm" = "A more recent version is available";
"BundleUpdater.DownloadConfirm" = "If you do not, there will be no usable map";
"BundleUpdater.NoHashNoAsset" = "The application requires a valid map either embedded or downloadable.";
"BundleUpdater.NoMapAvailable" = "No map available.";

// Locate Place View
"LocatePlaceView.Title" = "Locate Place";
"LocatePlaceView.Search" = "Search...";
"LocatePlaceView.Places" = "place(s)";

// Route Setup View
"RouteSetupView.Title" = "Route Setup";
"RouteSetupView.Start" = "Start";
"RouteSetupView.Accessible" = "Accessible";
"RouteSetupView.Optimize" = "Optimize";
"RouteSetupView.Optimized" = "Optimized";
"RouteSetupView.AddStart" = "Add start";
"RouteSetupView.AddDestination" = "Add destination";
"RouteSetupView.ComputeFail" = "Route not possible";
"RouteSetupView.PlaceNotAvailable" = "Place not available";

// Route View
"RouteView.Title" = "Navigation";
"RouteView.Options" = "Options";

// Navigation
"Navigation.Unknown" = "unknown";
"Navigation.GoStraight" = "continue";
"Navigation.TurnGentleRight" = "turn gentle right";
"Navigation.TurnGentleLeft" = "turn gentle left";
"Navigation.TurnRight" = "turn right";
"Navigation.TurnLeft" = "turn left";
"Navigation.TurnSharpRight" = "turn sharp right";
"Navigation.TurnSharpLeft" = "turn sharp left";
"Navigation.UTurnRight" = "make right U-turn";
"Navigation.UTurnLeft" = "make left U-turn";
"Navigation.Start" = "start";
"Navigation.End" = "destination";
"Navigation.GoUp" = "go up";
"Navigation.GoDown" = "go down";
"Navigation.ChangeModality" = "change transportation mode";
"Navigation.ChangeLayer" = "change buildings";
"Navigation.Waypoint" = "waypoint";
"Navigation.Then" = "then";
"Navigation.And" = "and";
"Navigation.Near" = "near";
"Navigation.Enter" = "enter";
"Navigation.Exit" = "exit";
"Navigation.Leave" = "leave";
"Navigation.OnceOutside" = "once outside";
"Navigation.OnceInside" = "once inside";
"Navigation.OnceAt" = "once at";
"Navigation.ArriveAt" = "arrive at";

// Navigation View
"NavigationView.GeneratingRoute" = "Displaying route";
"NavigationView.RegeneratingRoute" = "Refreshing route";


// Location
"Location.YourLocation" = "Your location";
